app/controllers/sites_controller.rb

  def show
    @site = Site.find(params[:id])
---
SELECT * FROM `sites` WHERE (`sites`.`id` = 1)

  def edit
    @site = Site.find(params[:id])
---
SELECT * FROM `sites` WHERE (`sites`.`id` = 1)

  def create
    @site = Site.new(params[:site])
    @site.user = current_user
    respond_to do |format|
      if @site.save
---
INSERT INTO `sites` (`name`, `created_at`, `updated_at`, `user_id`, `secret_key`) VALUES('igc', '2009-03-30 12:15:12', '2009-03-30 12:15:12', 1, 'hello')

  def update
    @site = Site.find(params[:id])

    respond_to do |format|
      if @site.update_attributes(params[:site])
---
SELECT * FROM `sites` WHERE (`sites`.`id` = 3)
UPDATE `sites` SET `updated_at` = '2009-03-30 20:56:13', `anonymous` = 0 WHERE `id` = 2

  def destroy
    @site = Site.find(params[:id])
    @site.destroy
---
SELECT * FROM `sites` WHERE (`sites`.`id` = 1)
DELETE FROM `sites` WHERE `id` = 1